base/InformationRegisters/бит_ДоступныеИнтерфейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ДоступныеИнтерфейсы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоступенРусский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_ДоступныеИнтерфейсы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыФункции
	
// Процедура проверяет правильность настроек доступности интерфеса в регистре бит_ДоступныеИнтерфейсы 
// и устанавливает новые настройки, согласно настройкам пользователя. 
// 
// Параметры:
//  ТекПользователь - СправочникСсылка.Пользователи.
// 
Процедура ПроверитьУстановитьДоступностьРусскогоИнтерфейса(ТекПользователь) Экспорт

	Если НЕ ЗначениеЗаполнено(ТекПользователь) Тогда
		Возврат;
  	КонецЕсли; 	
  
	УстановитьПривилегированныйРежим(Истина);

	ДоступенРусскийЯзык = ОпределитьДоступностьРусскогоИнтерфейса(ТекПользователь);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ДоступныеИнтерфейсы.ДоступенРусский
	|ИЗ
	|	РегистрСведений.бит_ДоступныеИнтерфейсы КАК бит_ДоступныеИнтерфейсы
	|ГДЕ
	|	бит_ДоступныеИнтерфейсы.Пользователь = &Пользователь";

	Результат = Запрос.Выполнить();

	флУстановить = Истина;

	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		флУстановить = Выборка.ДоступенРусский <> ДоступенРусскийЯзык;
	КонецЕсли; 

	Если флУстановить Тогда
		УстановитьДоступностьИнтерфейса(ТекПользователь, ДоступенРусскийЯзык);
	КонецЕсли; 

	УстановитьПривилегированныйРежим(Ложь);
  
КонецПроцедуры // ПроверитьУстановитьДоступностьИнтерфейса()

// Функция определяет доступность русского интерфейса пользователю.
// 
// Параметры:
//  ТекПользователь - СправочникСсылка.Пользователи.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ОпределитьДоступностьРусскогоИнтерфейса(ТекПользователь = Неопределено) Экспорт
	
	ДоступенРусскийЯзык = Истина;
	
	Если бит_ОбщегоНазначения.ЭтоИнтернационаяПоставка() Тогда
		
		Если ЗначениеЗаполнено(ТекПользователь) Тогда			
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекПользователь.ИдентификаторПользователяИБ);			
		Иначе			
			ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();			
		КонецЕсли;		
		
		Если ПользовательИБ <> Неопределено Тогда			
			Если ПользовательИБ.Язык <> Неопределено И ПользовательИБ.Язык <> Метаданные.Языки.Русский Тогда				
				ДоступенРусскийЯзык = Ложь;				
			КонецЕсли;			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат ДоступенРусскийЯзык;
	
КонецФункции // ОпределитьДоступностьРусскогоИнтерфейса()

// Процедура заполняет регистр, определяющий доступ к русскому интерфейсу.
// 
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт

	Если НЕ бит_ОбщегоНазначения.ЭтоИнтернационаяПоставка() Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ДоступныеИнтерфейсы КАК бит_ДоступныеИнтерфейсы
	|		ПО Пользователи.Ссылка = бит_ДоступныеИнтерфейсы.Пользователь
	|ГДЕ
	|	бит_ДоступныеИнтерфейсы.Пользователь ЕСТЬ NULL ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДоступенРусскийЯзык = ОпределитьДоступностьРусскогоИнтерфейса(Выборка.Пользователь);
		УстановитьДоступностьИнтерфейса(Выборка.Пользователь, ДоступенРусскийЯзык);
	КонецЦикла; 
	
КонецПроцедуры // ОбработатьДанныеДляПереходаНаНовуюВерсию()

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает доступность интерфейса.
// 
// Параметры:
//  ТекПользователь - СправочникСсылка.Пользователи.
//  ДоступенРусский - Булево.
// 
Процедура УстановитьДоступностьИнтерфейса(ТекПользователь, ДоступенРусский)
	
	МенеджерЗаписи = РегистрыСведений.бит_ДоступныеИнтерфейсы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь    = ТекПользователь;
	МенеджерЗаписи.ДоступенРусский = ДоступенРусский;
	
	Попытка		
		МенеджерЗаписи.Записать();		
	Исключение		
		ТекстСообщения = НСтр("ru='Не удалось установить доступность интерфейса пользователю ""%1"". Описание ошибки : ""%2"".';
							  |en='Unable to set the interface available to the user ""%1"". Description of error: ""%2"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекПользователь, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);		
	КонецПопытки;
	
КонецПроцедуры // УстановитьДоступностьИнтерфейса()

#КонецОбласти 

#КонецЕсли
